const About = () => {
  return (
    <section className="w-full bg-primary/40" id="about">
      <div className="max-w-5xl mx-auto px-10 py-12">
        <h2 className="text-3xl font-extrabold  mb-12 text-center">
          За нас и нашите кумове
        </h2>
        <p>
          Казват, че приятелства, които издържат повече от 7 години, са
          приятелства завинаги.
        </p>
        <br />
        <p>
          Момчи и Вальо са приятели още от детската градина, когато и двамата са
          имали не повече от 32 зъба общо. Дружбата им е преминала през обелени
          колене и скъсани гуменки, през първите любовни трепети и първите
          големи стъпки в живота.
        </p>

        <p>
          Марина и Калина се запознават още преди Марина да заживее в България,
          когато идва на гости при баба си. Всичко започва на площадката пред
          блока в ранните детски години - игри и смях ги сближават. С годините
          приятелството им се задълбочава, вече споделяйки и предизвикателствата
          на живота.
        </p>
        <br />

        <p>
          А сега – към младоженците. Момчи и Марина се запознават още в
          гимназията, но любовта им пламва години по-късно – през 2021-ва,
          когато съдбата ги среща отново. Сякаш тогава се преоткриват. Оттогава
          са неразделни и вървят ръка за ръка по пътя на живота, подкрепяйки се
          във всяко начинание. 🧡
        </p>
      </div>
    </section>
  );
};

export default About;
